{
  "title": {
    "en": "ADAView Roadmap",
    "fr": "Feuille de route de ADAView"
  },
  "description": {
    "en": "",
    "fr": ""
  },
  "phases": [
    {
      "title": {
        "en": "Initial Development",
        "fr": "Développement initial"
      },
      "timeline": {
        "en": "December 2021 - February 2022",
        "fr": "Décembre 2021 - Février 2022"
      },
      "description": {
        "en": "Domain, Server, Technology stack chosen. Infrastructure developed with cardano node, cardano dbsync, and custom components deployed on redundant infrastructure. Defined the initial wallet view requirements, and API contracts to support contextual wallet views.",
        "fr": "Domaine, serveur, pile technologique choisie. Infrastructure développée avec cardano node, cardano dbsync et des composants personnalisés déployés sur une infrastructure redondante. Définition des exigences initiales d'affichage du portefeuille et des contrats d'API."
      }
    },
    {
      "title": {
        "en": "Beta Release",
        "fr": "Version bêta"
      },
      "timeline": {
        "en": "February 2022 - March 2022",
        "fr": "Février 2022 - Mars 2022"
      },
      "description": {
        "en": "Wallet overview and contextualized transactions with associated transaction events. Integrated rewards with the utxo based transactions into a unified transaction view. Display additional data associated with a wallet such as stake pools, addresses, and assets.",
        "fr": "Aperçu du portefeuille et transactions contextualisées avec les événements de transaction associés. Récompenses intégrées avec les transactions basées sur utxo dans une vue de transaction unifiée. Affichez les données supplémentaires associées à un portefeuille, telles que les pools de mises, les adresses et les atouts."
      }
    },
    {
      "title": {
        "en": "Beta Updates",
        "fr": "Mises à jour bêta"
      },
      "timeline": {
        "en": "March 2022 - April 2022",
        "fr": "Mars 2022 - Avril 2022"
      },
      "description": {
        "en": "Integration of stakepool metadata, and enhanced metadata and other offchain sources. Integration of asset metadata, and separation of fungible and non fungible assets. Integration of additional wallet types, legacy byron, icarus and non-staking shelley.",
        "fr": "Intégration des métadonnées du pool de participations et autres sources hors chaîne. Intégration des métadonnées des atouts et séparation des atouts fongibles et non fongibles. Intégration de types de portefeuilles supplémentaires, legacy byron, icarus et non-staking shelley."
      }
    },
    {
      "title": {
        "en": "Beta Updates",
        "fr": "Mises à jour bêta"
      },
      "timeline": {
        "en": "April 2022 - May 2022",
        "fr": "Avril 2022 - Mai 2022"
      },
      "description": {
        "en": "Integration of an Asset Gallery for displaying NFT and other assets associated with a wallet. Ability to display stakepool overviews and search for stakepool data and operators.",
        "fr": "Intégration d'une galerie d'atouts pour afficher des NFT et autres associés à un portefeuille. Afficher des aperçus de pools et de recherche des données et des opérateurs de pools."
      }
    },
    {
      "title": {
        "en": "Live Release 1",
        "fr": "Version 1"
      },
      "timeline": {
        "en": "Spring 2022",
        "fr": "Printemps 2022"
      },
      "description": {
        "en": "Migration to live servers and www domain instead of the beta domain. Verification of language packs.",
        "fr": "Migration vers des serveurs de production et un domaine www au lieu du domaine bêta. Vérification des traductions."
      }
    },
    {
      "title": {
        "en": "Live Release 2",
        "fr": "Version 2"
      },
      "timeline": {
        "en": "Summer 2022",
        "fr": "Été 2022"
      },
      "description": {
        "en": "Introduction of NFT based avatars which will allow users to customize their wallets with images, names and possibly additional themes to match business themes or other color schemes. Additional Language packs and i18n features.",
        "fr": "Introduction d'avatars basés sur NFT qui permettront aux utilisateurs de personnaliser leurs portefeuilles avec des images, des noms et éventuellement des thèmes supplémentaires pour correspondre à des thèmes commerciaux ou à d'autres schémas de couleurs. Modules linguistiques supplémentaires et fonctionnalités i18n."
      }
    },
    {
      "title": {
        "en": "Live Release 3",
        "fr": "Version 3"
      },
      "timeline": {
        "en": "Fall 2022",
        "fr": "Automne 2022"
      },
      "description": {
        "en": "Introduce analytical components to allow for tracing transactions and building networks of intercommunicating wallets.",
        "fr": "Introduire des composants analytiques pour permettre le traçage des transactions et la construction de réseaux de portefeuilles."
      }
    }
  ]
}
