{
  "title": {
    "en": "ADAView Roadmap",
    "fr": "Feuille de route de ADAView"
  },
  "description": {
    "en": "",
    "fr": ""
  },
  "phases": [
    {
      "title": {
        "en": "Initial Development",
        "fr": "Développement initial"
      },
      "timeline": {
        "en": "December 2021 - February 2022",
        "fr": "Décembre 2021 - Février 2022"
      },
      "description": {
        "en": "Domain, Server, Technology stack chosen. Infrastructure developed with cardano node, cardano dbsync, and custom components deployed on redundant infrastructure. Defined the initial wallet view requirements, and API contracts to support contextual wallet views.",
        "fr": "Domaine, serveur, pile technologique choisie. Infrastructure développée avec cardano node, cardano dbsync et des composants personnalisés déployés sur une infrastructure redondante. Définition des exigences initiales d'affichage du portefeuille et des contrats d'API."
      }
    },
    {
      "title": {
        "en": "Beta Release",
        "fr": "Version bêta"
      },
      "timeline": {
        "en": "February 2022 - March 2022",
        "fr": "Février 2022 - Mars 2022"
      },
      "description": {
        "en": "Wallet overview and contextualized transactions with associated transaction events. Integrated rewards with the utxo based transactions into a unified transaction view. Display additional data associated with a wallet such as stake pools, addresses, and assets.",
        "fr": "Aperçu du portefeuille et transactions contextualisées avec les événements de transaction associés. Récompenses intégrées avec les transactions basées sur utxo dans une vue de transaction unifiée. Affichez les données supplémentaires associées à un portefeuille, telles que les pools de mises, les adresses et les atouts."
      }
    },
    {
      "title": {
        "en": "Beta Updates",
        "fr": "Mises à jour bêta"
      },
      "timeline": {
        "en": "March 2022 - April 2022",
        "fr": "Mars 2022 - Avril 2022"
      },
      "description": {
        "en": "Integration of stakepool metadata, and enhanced metadata and other offchain sources.",
        "fr": "Intégration des métadonnées du pool de participations et autres sources hors chaîne."
      }
    },
    {
      "title": {
        "en": "Backend Rewrite",
        "fr": "Réécriture du backend"
      },
      "timeline": {
        "en": "April 2022 - October 2022",
        "fr": "Avril 2022 - Octobre 2022"
      },
      "description": {
        "en": "Developing updated API's using CRQS/ES API management to improve performance of larger wallets and eliminate the need for realtime queries.",
        "fr": "Mises à jour des APIS avec l'aide de CRQS/ES pour améliorer le performance des portefeuilles volumineux et éliminer le besoin de requêtes en temps réel."
      }
    },
    {
      "title": {
        "en": "Preview and Preprod",
        "fr": "Preview et Preprod"
      },
      "timeline": {
        "en": "October 2022 - December 2022",
        "fr": "Octobre 2022 - Décembre 2022"
      },
      "description": {
        "en": "Added support for new preprod and preview networks.",
        "fr": "Ajout des nouveaux réseaux de préprod / preview."
      }
    },    
    {
      "title": {
        "en": "Release 1.0.0",
        "fr": "Version 1.0.0"
      },
      "timeline": {
        "en": "January 2023",
        "fr": "Janvier 2023"
      },
      "description": {
        "en": "Initial public release.",
        "fr": "Première version publique."
      }
    },
    {
      "title": {
        "en": "Release 1.1.0",
        "fr": "Version 1.1.0"
      },
      "timeline": {
        "en": "Winter 2023",
        "fr": "Hiver 2023"
      },
      "description": {
        "en": "Focused on additional legacy address compatibility, and asset metadata integration.",
        "fr": "Concentré sur la compatibilité des adresses héritées supplémentaires et l'intégration des métadonnées des actifs."
      }
    }
  ]
}
